[
  {
    "title":"Plasmic Reflection",
    "category": "experiments",
    "imgsrc": "/images/pulse_square.png",
    "thumbnail": "/images/pulse_square_thumb.png",
    "desc": "An arduino based infinity mirror that reflects the user's hearbeat in light and sound",
    "date": "ITP | DEC 2015",
    "id": "reflected",
    "hasVideo":true,
    "hasPage": true,
    "src":"https://player.vimeo.com/video/149091016",
    "projectLink":"http://itp.jcharry.com/2015/12/14/plasmic-reflections-final-documentation/",
    "credits": "An ITP Project by Jamie Charry & Ella Dagan. Dec 2015",
    "longdesc":"A unique and personal experience, the Plasmic Reflection mirror encourages the user to fully inhabit their body and mind.  Developed over the course of several weeks at NYU ITP, the mirror acts as an extension of the user's heartbeat, allowing them to enter a meditative place where they are invited to look inward, or find silence.  Ultimately, the experience is up to the viewer."
  },
  {
    "title": "Quppled",
    "category": "apps",
    "imgsrc":"/images/quppled_thumb.png",
    "thumbnail":"/images/quppled_thumb.png",
    "desc": "Very much in progress (but back burnered) Swift iOS app for meeting new couple friends.  Some might call it double dating.",
    "longdesc": "Because couple to couple interactions have a special cadence, and a unique place in peoples lives, we thought it would be a great idea to create a service that allows couples to easily connect  Thus, Quppled was born.  It's My first real dive into iOS development, and it leverages Parse as a user database to store saved matches as well as questions answered by the user.  Cloud Code, a parse feature that allows for simple server side logic, is used to parse user answers and determine the best match available in the user database.  Each day a user gets a new match, whom they can message, or save for later.",
    "date": "In Development, Started 2015",
    "src":"https://player.vimeo.com/video/151353179",
    "id":"quppled",
    "projectLink":"https://github.com/jcharry/quppled",
    "hasVideo": false,
    "hasPage": true,
    "credits":""
  },
  {
    "title": "Question a Day",
    "category": "web",
    "imgsrc": "/images/qadsquare.png",
    "thumbnail":"/images/qadsquare_thumb.png",
    "desc": "Node.js Express app leveraging basic sentiment analysis to create a public journal-a-day where all our feelings are heard equally",
    "longdesc": "In today's facebook flooded internet world, we're often inundated with other people's feelings.  But so often it feels forced, as if they're asking for sympathy or looking for someone to acknowledge them.  Question a Day is a simple attempt to allow for sharing of deep feelings without the need for sympathy or attention, just the idea that by putting your feelings out there, we just might all feel a bit more connected.",
    "date": "ITP | DEC 2015",
    "src":"http://questionaday.herokuapp.com",
    "id":"qad",
    "projectLink":"http://questionaday.herokuapp.com/",
    "hasVideo": false,
    "hasPage": true,
    "credits": ""
  },
  {
    "title":"Solar Synthesizer",
    "category": "experiments",
    "imgsrc": "/images/solarsynthsquare.png",
    "thumbnail":"/images/solarsynthsquare_thumb.png",
    "desc": "A p5.js based synth where our solar system becomes the instrument",
    "longdesc": "What if there was sound in space?  What if the planets made music?  This began with wanting to create an accurate model of solar orbits, and leveragin Kepler's equations of planetary motion, these orbirts are indeed accurate to scale.  Combined with the pleasure of hearing some nice tones as they float through space, this becomes a peaceful way to appreciate the solar system in all it's vastness.",
    "date": "ITP | OCT 2015",
    "src":"http://itp.jcharry.com/solarSystem",
    "id": "solarsynth",
    "projectLink":"http://itp.jcharry.com/solarSystem/",
    "hasVideo": false,
    "credits": "By Jamie Charry"
  },
  {
    "title":"Artist Comparator",
    "category":"experiments",
    "imgsrc": "/images/artistcompsquare.png",
    "thumbnail": "/images/artistcompsquare_thumb.png",
    "desc": "Utilizing p5.js and the EchoNest API, check out how your two favorite artists compare",
    "longdesc": "Echo Nest provides a great API that not only catalogs pretty much every musical artist alive, but attempts to qualify their music based on dozens of factors.  Most interestingly they attempt to quantify various aspects of a song, i.e. danceability or acousticness, among others.  So why not use this data to see how two artists stack up?",
    "date": "ITP | NOV 2015",
    "src":"http://itp.jcharry.com/artistComparator",
    "id":"artistcomp",
    "projectLink":"http://itp.jcharry.com/artistComparator/",
    "hasVideo": false,
    "credits": ""
  },
  {
    "title":"HSB Drawings",
    "category": "experiments",
    "imgsrc": "/images/hsbsquare_thumb.png",
    "thumbnail": "/images/hsbsquare_thumb.png",
    "desc": "Exploring HSB color space with p5.js",
    "longdesc": "Getting a feel for color on the web takes some time, so playing with HSB in p5 was a nice way to get some practice.  These super quick sketches illustrate how easy it can be to get a pretty visual with only a few lines in p5.  Applying translations and rotations as well as iterating through HSB values gives a tremendous amount of opportunity to create beautiful visuals.",
    "date": "ITP | NOV 2015",
    "src":"http://itp.jcharry.com/colorFlowers",
    "id":"colorflowers",
    "projectLink":"http://itp.jcharry.com/colorFlowers",
    "hasVideo": false,
    "credits": ""
  },
  {
    "title":"Particles and Waves",
    "category": "experiments",
    "imgsrc": "/images/particlesandwavessquare_thumb.png",
    "thumbnail": "/images/particlesandwavessquare_thumb.png",
    "desc": "Playing with object interaction with p5.js",
    "longdesc": "A very early sketch to get a handle on object creation, interaction, and desctruction using p5 in the canvas.",
    "date": "ITP | NOV 2015",
    "src":"http://itp.jcharry.com/particlesAndWaves",
    "id":"particlesandwaves",
    "projectLink":"http://itp.jcharry.com/particlesAndWaves",
    "hasVideo": false,
    "credits": ""
  }
]
